<?php

declare(strict_types=1);

return [
    // Australia
    'AU' => 'أستراليا',
    'AU-ACT' => 'أستراليا - إقليم العاصمة الأسترالية',
    'AU-NSW' => 'أستراليا - نيو ساوث ويلز',
    'AU-NT' => 'أستراليا - الإقليم الشمالي',
    'AU-QLD' => 'أستراليا - كوينزلاند',
    'AU-SA' => 'أستراليا - جنوب أستراليا',
    'AU-TAS' => 'أستراليا - تسمانيا',
    'AU-VIC' => 'أستراليا - فيكتوريا',
    'AU-WA' => 'أستراليا - أستراليا الغربية',

    // Austria
    'AT' => 'النمسا',
    'AT-1' => 'النمسا - بورغنلاند',
    'AT-2' => 'النمسا - كارينثيا',
    'AT-3' => 'النمسا - النمسا السفلى',
    'AT-4' => 'النمسا - النمسا العليا',
    'AT-5' => 'النمسا - سالزبورغ',
    'AT-6' => 'النمسا - شتايرمارك',
    'AT-7' => 'النمسا - تيرول',
    'AT-8' => 'النمسا - فورارلبرغ',
    'AT-9' => 'النمسا - فيينا',

    // Belarus
    'BY' => 'بيلاروس',

    // Belgium
    'BE' => 'بلجيكا',

    // Brazil
    'BR' => 'البرازيل',

    // Bulgaria
    'BG' => 'بلغاريا',

    // Canada
    'CA' => 'كندا',
    'CA-AB' => 'كندا - ألبرتا',
    'CA-BC' => 'كندا - كولومبيا البريطانية',
    'CA-MB' => 'كندا - مانيتوبا',
    'CA-NB' => 'كندا - نيو برونزويك',
    'CA-NL' => 'كندا - نيوفاوندلاند ولابرادور',
    'CA-NT' => 'كندا - الأقاليم الشمالية الغربية',
    'CA-NS' => 'كندا - نوفا سكوشا',
    'CA-NU' => 'كندا - نونافوت',
    'CA-ON' => 'كندا - أونتاريو',
    'CA-PE' => 'كندا - جزيرة الأمير إدوارد',
    'CA-QC' => 'كندا - كيبيك',
    'CA-SK' => 'كندا - ساسكاتشوان',
    'CA-YT' => 'كندا - يوكون',

    // Czech Republic
    'CZ' => 'التشيك',

    // Denmark
    'DK' => 'الدانمرك',

    // Estonia
    'EE' => 'إستونيا',

    // Finland
    'FI' => 'فنلندا',

    // France
    'FR' => 'فرنسا',
    'FR-57' => 'فرنسا - موزيل',
    'FR-67' => 'فرنسا - الراين الأسفل',
    'FR-68' => 'فرنسا - الراين الأعلى',
    'FR-GF' => 'فرنسا - غويانا الفرنسية',
    'FR-GUA' => 'فرنسا - غوادلوب',
    'FR-LRE' => 'فرنسا - ريونيون',
    'FR-MQ' => 'فرنسا - مارتينيك',

    // Germany
    'DE' => 'ألمانيا',
    'DE-BB' => 'ألمانيا - براندنبورغ',
    'DE-BE' => 'ألمانيا - برلين',
    'DE-BW' => 'ألمانيا - بادن فورتمبيرغ',
    'DE-BY' => 'ألمانيا - بافاريا',
    'DE-HB' => 'ألمانيا - بريمن',
    'DE-HE' => 'ألمانيا - هسن',
    'DE-HH' => 'ألمانيا - هامبورغ',
    'DE-MV' => 'ألمانيا - مكلنبورغ فوربومرن',
    'DE-NI' => 'ألمانيا - ساكسونيا السفلى',
    'DE-NW' => 'ألمانيا - شمال الراين وستفاليا',
    'DE-RP' => 'ألمانيا - راينلاند بالاتينات',
    'DE-SH' => 'ألمانيا - شليسفيغ هولشتاين',
    'DE-SL' => 'ألمانيا - سارلاند',
    'DE-SN' => 'ألمانيا - ساكسونيا',
    'DE-ST' => 'ألمانيا - ساكسونيا أنهالت',
    'DE-TH' => 'ألمانيا - تورينغن',

    // Greenland
    'GL' => 'غرينلاند',

    // Iceland
    'IS' => 'آيسلندا',

    // Ireland
    'IE' => 'أيرلندا',

    // Italy
    'IT' => 'إيطاليا',
    'IT-32' => 'إيطاليا - جنوب تيرول',

    // Latvia
    'LV' => 'لاتفيا',

    // Liechtenstein
    'FL' => 'ليختنشتاين',

    // Lithuania
    'LT' => 'ليتوانيا',

    // Luxembourg
    'LU' => 'لوكسمبورغ',

    // Mexico
    'MX' => 'المكسيك',

    // Netherlands
    'NL' => 'هولندا',

    // Norway
    'NO' => 'النرويج',

    // Poland
    'PL' => 'بولندا',

    // Portugal
    'PT' => 'البرتغال',
    'PT-20' => 'البرتغال - جزر الأزور',
    'PT-30' => 'البرتغال - ماديرا',

    // Russia
    'RU' => 'روسيا',

    // Spain
    'ES' => 'إسبانيا',

    // Sweden
    'SE' => 'السويد',

    // Switzerland
    'CH' => 'سويسرا',
    'CH-AG' => 'سويسرا - أرغاو',
    'CH-AI' => 'سويسرا - أبنزل إنرهودن',
    'CH-AR' => 'سويسرا - أبنزل أوسرهودن',
    'CH-BE' => 'سويسرا - برن',
    'CH-BL' => 'سويسرا - بازل لاندشافت',
    'CH-BS' => 'سويسرا - بازل شتات',
    'CH-FR' => 'سويسرا - فريبورغ',
    'CH-GE' => 'سويسرا - جنيف',
    'CH-GL' => 'سويسرا - غلاروس',
    'CH-GR' => 'سويسرا - غراوبوندن',
    'CH-JU' => 'سويسرا - جورا',
    'CH-LU' => 'سويسرا - لوتسرن',
    'CH-NE' => 'سويسرا - نوشاتيل',
    'CH-NW' => 'سويسرا - نيدفالدن',
    'CH-OW' => 'سويسرا - أوبفالدن',
    'CH-SG' => 'سويسرا - سانت غالن',
    'CH-SH' => 'سويسرا - شافهاوزن',
    'CH-SO' => 'سويسرا - سولوتورن',
    'CH-SZ' => 'سويسرا - شفيتس',
    'CH-TG' => 'سويسرا - تورغاو',
    'CH-TI' => 'سويسرا - تيتشينو',
    'CH-UR' => 'سويسرا - أوري',
    'CH-VD' => 'سويسرا - فو',
    'CH-VS' => 'سويسرا - فاليه',
    'CH-ZG' => 'سويسرا - تسوغ',
    'CH-ZH' => 'سويسرا - زيورخ',

    // Turkey
    'TR' => 'تركيا',

    // Ukraine
    'UA' => 'أوكرانيا',

    // United Kingdom
    'GB' => 'المملكة المتحدة',
    'GB-NIR' => 'المملكة المتحدة - أيرلندا الشمالية',
    'GB-SCT' => 'المملكة المتحدة - اسكتلندا',

    // USA
    'US' => 'الولايات المتحدة',
];
