<?php

declare(strict_types=1);

return [
    // Australia
    'AU' => 'אוסטרליה',
    'AU-ACT' => 'אוסטרליה - טריטוריית הבירה האוסטרלית',
    'AU-NSW' => 'אוסטרליה - ניו סאות׳ ויילס',
    'AU-NT' => 'אוסטרליה - הטריטוריה הצפונית',
    'AU-QLD' => 'אוסטרליה - קווינסלנד',
    'AU-SA' => 'אוסטרליה - אוסטרליה הדרומית',
    'AU-TAS' => 'אוסטרליה - טסמניה',
    'AU-VIC' => 'אוסטרליה - ויקטוריה',
    'AU-WA' => 'אוסטרליה - אוסטרליה המערבית',

    // Austria
    'AT' => 'אוסטריה',
    'AT-1' => 'אוסטריה - בורגנלנד',
    'AT-2' => 'אוסטריה - קרינתיה',
    'AT-3' => 'אוסטריה - אוסטריה התחתית',
    'AT-4' => 'אוסטריה - אוסטריה העילית',
    'AT-5' => 'אוסטריה - זלצבורג',
    'AT-6' => 'אוסטריה - שטיריה',
    'AT-7' => 'אוסטריה - טירול',
    'AT-8' => 'אוסטריה - פורארלברג',
    'AT-9' => 'אוסטריה - וינה',

    // Belarus
    'BY' => 'בלארוס',

    // Belgium
    'BE' => 'בלגיה',

    // Brazil
    'BR' => 'ברזיל',

    // Bulgaria
    'BG' => 'בולגריה',

    // Canada
    'CA' => 'קנדה',
    'CA-AB' => 'קנדה - אלברטה',
    'CA-BC' => 'קנדה - קולומביה הבריטית',
    'CA-MB' => 'קנדה - מניטובה',
    'CA-NB' => 'קנדה - ניו ברנזוויק',
    'CA-NL' => 'קנדה - ניופאונדלנד ולברדור',
    'CA-NT' => 'קנדה - הטריטוריות הצפון־מערביות',
    'CA-NS' => 'קנדה - נובה סקוטיה',
    'CA-NU' => 'קנדה - נונאווט',
    'CA-ON' => 'קנדה - אונטריו',
    'CA-PE' => 'קנדה - אי הנסיך אדוארד',
    'CA-QC' => 'קנדה - קוויבק',
    'CA-SK' => 'קנדה - ססקצ׳ואן',
    'CA-YT' => 'קנדה - יוקון',

    // Czech Republic
    'CZ' => 'צ׳כיה',

    // Denmark
    'DK' => 'דנמרק',

    // Estonia
    'EE' => 'אסטוניה',

    // Finland
    'FI' => 'פינלנד',

    // France
    'FR' => 'צרפת',
    'FR-57' => 'צרפת - מוזל',
    'FR-67' => 'צרפת - הריין התחתון',
    'FR-68' => 'צרפת - הריין העליון',
    'FR-GF' => 'צרפת - גיאנה הצרפתית',
    'FR-GUA' => 'צרפת - גוואדלופ',
    'FR-LRE' => 'צרפת - ראוניון',
    'FR-MQ' => 'צרפת - מרטיניק',

    // Germany
    'DE' => 'גרמניה',
    'DE-BB' => 'גרמניה - ברנדנבורג',
    'DE-BE' => 'גרמניה - ברלין',
    'DE-BW' => 'גרמניה - באדן־וירטמברג',
    'DE-BY' => 'גרמניה - בוואריה',
    'DE-HB' => 'גרמניה - ברמן',
    'DE-HE' => 'גרמניה - הסן',
    'DE-HH' => 'גרמניה - המבורג',
    'DE-MV' => 'גרמניה - מקלנבורג־מערב פומרניה',
    'DE-NI' => 'גרמניה - סקסוניה התחתונה',
    'DE-NW' => 'גרמניה - נורדריין־וסטפאליה',
    'DE-RP' => 'גרמניה - ריינלנד־פפאלץ',
    'DE-SH' => 'גרמניה - שלזוויג־הולשטיין',
    'DE-SL' => 'גרמניה - חבל הסאר',
    'DE-SN' => 'גרמניה - סקסוניה',
    'DE-ST' => 'גרמניה - סקסוניה־אנהלט',
    'DE-TH' => 'גרמניה - תורינגיה',

    // Greenland
    'GL' => 'גרינלנד',

    // Iceland
    'IS' => 'איסלנד',

    // Ireland
    'IE' => 'אירלנד',

    // Italy
    'IT' => 'איטליה',
    'IT-32' => 'איטליה - דרום טירול',

    // Latvia
    'LV' => 'לטביה',

    // Liechtenstein
    'FL' => 'ליכטנשטיין',

    // Lithuania
    'LT' => 'ליטא',

    // Luxembourg
    'LU' => 'לוקסמבורג',

    // Mexico
    'MX' => 'מקסיקו',

    // Netherlands
    'NL' => 'הולנד',

    // Norway
    'NO' => 'נורווגיה',

    // Poland
    'PL' => 'פולין',

    // Portugal
    'PT' => 'פורטוגל',
    'PT-20' => 'פורטוגל - האיים האזוריים',
    'PT-30' => 'פורטוגל - מדיירה',

    // Russia
    'RU' => 'רוסיה',

    // Spain
    'ES' => 'ספרד',

    // Sweden
    'SE' => 'שוודיה',

    // Switzerland
    'CH' => 'שווייץ',
    'CH-AG' => 'שווייץ - ארגאו',
    'CH-AI' => 'שווייץ - אפנצל אינר־רודן',
    'CH-AR' => 'שווייץ - אפנצל אוסר־רודן',
    'CH-BE' => 'שווייץ - ברן',
    'CH-BL' => 'שווייץ - בזל־לנדשאפט',
    'CH-BS' => 'שווייץ - בזל־שטאדט',
    'CH-FR' => 'שווייץ - פריבור',
    'CH-GE' => 'שווייץ - ז׳נבה',
    'CH-GL' => 'שווייץ - גלרוס',
    'CH-GR' => 'שווייץ - גראובינדן',
    'CH-JU' => 'שווייץ - ז׳ורה',
    'CH-LU' => 'שווייץ - לוצרן',
    'CH-NE' => 'שווייץ - נשאטל',
    'CH-NW' => 'שווייץ - נידוולדן',
    'CH-OW' => 'שווייץ - אובוולדן',
    'CH-SG' => 'שווייץ - סנט גאלן',
    'CH-SH' => 'שווייץ - שאפהאוזן',
    'CH-SO' => 'שווייץ - זולותורן',
    'CH-SZ' => 'שווייץ - שוויץ',
    'CH-TG' => 'שווייץ - תורגאו',
    'CH-TI' => 'שווייץ - טיצ׳ינו',
    'CH-UR' => 'שווייץ - אורי',
    'CH-VD' => 'שווייץ - וו',
    'CH-VS' => 'שווייץ - ואלה',
    'CH-ZG' => 'שווייץ - צוג',
    'CH-ZH' => 'שווייץ - ציריך',

    // Turkey
    'TR' => 'טורקיה',

    // Ukraine
    'UA' => 'אוקראינה',

    // United Kingdom
    'GB' => 'בריטניה',
    'GB-NIR' => 'בריטניה - צפון אירלנד',
    'GB-SCT' => 'בריטניה - סקוטלנד',

    // USA
    'US' => 'ארצות הברית',
];
