<?php

declare(strict_types=1);

return [
    // Australia
    'AU' => '澳大利亚',
    'AU-ACT' => '澳大利亚 - 首都领地',
    'AU-NSW' => '澳大利亚 - 新南威尔士州',
    'AU-NT' => '澳大利亚 - 北领地',
    'AU-QLD' => '澳大利亚 - 昆士兰州',
    'AU-SA' => '澳大利亚 - 南澳大利亚州',
    'AU-TAS' => '澳大利亚 - 塔斯马尼亚州',
    'AU-VIC' => '澳大利亚 - 维多利亚州',
    'AU-WA' => '澳大利亚 - 西澳大利亚州',

    // Austria
    'AT' => '奥地利',
    'AT-1' => '奥地利 - 布尔根兰州',
    'AT-2' => '奥地利 - 克恩顿州',
    'AT-3' => '奥地利 - 下奥地利州',
    'AT-4' => '奥地利 - 上奥地利州',
    'AT-5' => '奥地利 - 萨尔茨堡州',
    'AT-6' => '奥地利 - 施蒂里亚州',
    'AT-7' => '奥地利 - 蒂罗尔州',
    'AT-8' => '奥地利 - 福拉尔贝格州',
    'AT-9' => '奥地利 - 维也纳',

    // Belarus
    'BY' => '白俄罗斯',

    // Belgium
    'BE' => '比利时',

    // Brazil
    'BR' => '巴西',

    // Bulgaria
    'BG' => '保加利亚',

    // Canada
    'CA' => '加拿大',
    'CA-AB' => '加拿大 - 阿尔伯塔省',
    'CA-BC' => '加拿大 - 不列颠哥伦比亚省',
    'CA-MB' => '加拿大 - 曼尼托巴省',
    'CA-NB' => '加拿大 - 新不伦瑞克省',
    'CA-NL' => '加拿大 - 纽芬兰和拉布拉多省',
    'CA-NT' => '加拿大 - 西北地区',
    'CA-NS' => '加拿大 - 新斯科舍省',
    'CA-NU' => '加拿大 - 努纳武特地区',
    'CA-ON' => '加拿大 - 安大略省',
    'CA-PE' => '加拿大 - 爱德华王子岛省',
    'CA-QC' => '加拿大 - 魁北克省',
    'CA-SK' => '加拿大 - 萨斯喀彻温省',
    'CA-YT' => '加拿大 - 育空地区',

    // Czech Republic
    'CZ' => '捷克共和国',

    // Denmark
    'DK' => '丹麦',

    // Estonia
    'EE' => '爱沙尼亚',

    // Finland
    'FI' => '芬兰',

    // France
    'FR' => '法国',
    'FR-57' => '法国 - 摩泽尔省',
    'FR-67' => '法国 - 下莱茵省',
    'FR-68' => '法国 - 上莱茵省',
    'FR-GF' => '法国 - 法属圭亚那',
    'FR-GUA' => '法国 - 瓜德罗普',
    'FR-LRE' => '法国 - 留尼汪',
    'FR-MQ' => '法国 - 马提尼克',

    // Germany
    'DE' => '德国',
    'DE-BB' => '德国 - 勃兰登堡州',
    'DE-BE' => '德国 - 柏林',
    'DE-BW' => '德国 - 巴登-符腾堡州',
    'DE-BY' => '德国 - 巴伐利亚州',
    'DE-HB' => '德国 - 不来梅',
    'DE-HE' => '德国 - 黑森州',
    'DE-HH' => '德国 - 汉堡',
    'DE-MV' => '德国 - 梅克伦堡-前波莫瑞州',
    'DE-NI' => '德国 - 下萨克森州',
    'DE-NW' => '德国 - 北莱茵-威斯特法伦州',
    'DE-RP' => '德国 - 莱茵兰-普法尔茨州',
    'DE-SH' => '德国 - 石勒苏益格-荷尔斯泰因州',
    'DE-SL' => '德国 - 萨尔州',
    'DE-SN' => '德国 - 萨克森州',
    'DE-ST' => '德国 - 萨克森-安哈尔特州',
    'DE-TH' => '德国 - 图林根州',

    // Greenland
    'GL' => '格陵兰',

    // Iceland
    'IS' => '冰岛',

    // Ireland
    'IE' => '爱尔兰',

    // Italy
    'IT' => '意大利',
    'IT-32' => '意大利 - 南蒂罗尔',

    // Latvia
    'LV' => '拉脱维亚',

    // Liechtenstein
    'FL' => '列支敦士登',

    // Lithuania
    'LT' => '立陶宛',

    // Luxembourg
    'LU' => '卢森堡',

    // Mexico
    'MX' => '墨西哥',

    // Netherlands
    'NL' => '荷兰',

    // Norway
    'NO' => '挪威',

    // Poland
    'PL' => '波兰',

    // Portugal
    'PT' => '葡萄牙',
    'PT-20' => '葡萄牙 - 亚速尔群岛',
    'PT-30' => '葡萄牙 - 马德拉',

    // Russia
    'RU' => '俄罗斯',

    // Spain
    'ES' => '西班牙',

    // Sweden
    'SE' => '瑞典',

    // Switzerland
    'CH' => '瑞士',
    'CH-AG' => '瑞士 - 阿尔高州',
    'CH-AI' => '瑞士 - 内阿彭策尔州',
    'CH-AR' => '瑞士 - 外阿彭策尔州',
    'CH-BE' => '瑞士 - 伯尔尼州',
    'CH-BL' => '瑞士 - 巴塞尔乡村州',
    'CH-BS' => '瑞士 - 巴塞尔城市州',
    'CH-FR' => '瑞士 - 弗里堡州',
    'CH-GE' => '瑞士 - 日内瓦州',
    'CH-GL' => '瑞士 - 格拉鲁斯州',
    'CH-GR' => '瑞士 - 格劳宾登州',
    'CH-JU' => '瑞士 - 汝拉州',
    'CH-LU' => '瑞士 - 卢塞恩州',
    'CH-NE' => '瑞士 - 纳沙泰尔州',
    'CH-NW' => '瑞士 - 下瓦尔登州',
    'CH-OW' => '瑞士 - 上瓦尔登州',
    'CH-SG' => '瑞士 - 圣加仑州',
    'CH-SH' => '瑞士 - 沙夫豪森州',
    'CH-SO' => '瑞士 - 索洛图恩州',
    'CH-SZ' => '瑞士 - 施维茨州',
    'CH-TG' => '瑞士 - 图尔高州',
    'CH-TI' => '瑞士 - 提契诺州',
    'CH-UR' => '瑞士 - 乌里州',
    'CH-VD' => '瑞士 - 沃州',
    'CH-VS' => '瑞士 - 瓦莱州',
    'CH-ZG' => '瑞士 - 楚格州',
    'CH-ZH' => '瑞士 - 苏黎世州',

    // Turkey
    'TR' => '土耳其',

    // Ukraine
    'UA' => '乌克兰',

    // United Kingdom
    'GB' => '英国',
    'GB-NIR' => '英国 - 北爱尔兰',
    'GB-SCT' => '英国 - 苏格兰',

    // USA
    'US' => '美国',
];
